with open ('text.txt', encoding = 'utf-8') as y:
    t0 = y.read()
t1=t0.replace('.',' ')
t2=t1.replace(',',' ')
t3=t2.replace('?',' ')
t4=t3.replace('!',' ')
t5=t4.replace(':',' ')
t6=t5.replace('(',' ')
t7=t6.replace(')',' ')
t=t7.replace('\n',' ')
w1=t.split()
r=['а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ъ','Ы','Ь','Э','Ю','Я','-']

x=0

for w in w1:
    for a in w:
        if a not in r:
            w1.remove(w)
            break
    if len(w) > 10:
        x += 1

if len(w1) == 0:
    print("Нужен текст на русском")
else:
    print(100*x/len(w1), "%")
